//AGIB610W JOB (AGI,PROD),'VERISK PROPERTY DA',CLASS=A,MSGCLASS=X,
//         NOTIFY=&SYSUID,REGION=0M
//* ------------------------------------------------------------------
//* Verisk property data enrichment
//* SCHEDULED VIA CONTROL-M - DO NOT SUBMIT MANUALLY EXCEPT UNDER
//* MIM-122313 BREAK-GLASS. LAST MANUAL SUBMIT 04-Oct-2022 CAUSED
//* DUPLICATE BACS FILE. SEE PRB-73459.
//* ------------------------------------------------------------------
//STEP010  EXEC PGM=AGIDWH07,PARM='WEEKLY'
//STEPLIB  DD DSN=AGI.PROD.LOADLIB,DISP=SHR
//POLIN    DD DSN=AGI.PROD.PARTY.FLOODRE.IN(+0),DISP=SHR
//POLOUT   DD DSN=AGI.PROD.PARTY.FLOODRE.OUT(+1),DISP=(NEW,CATLG,DELETE),
//            SPACE=(CYL,(500,100),RLSE),
//            DCB=(RECFM=FB,LRECL=512,BLKSIZE=0)
//SYSOUT   DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//STEP020  EXEC PGM=IEBGENER,COND=(0,NE,STEP010)
//SYSUT1   DD DSN=AGI.PROD.PARTY.FLOODRE.OUT(+1),DISP=SHR
//SYSUT2   DD DSN=AGI.XFER.GWSUITE.AGIB610W,DISP=(NEW,CATLG),
//            SPACE=(CYL,(500,100),RLSE)
//SYSPRINT DD SYSOUT=*
//SYSIN    DD DUMMY
