//AGIB870D JOB (AGI,PROD),'AGGREGATOR GATEWAY',CLASS=A,MSGCLASS=X,
//         NOTIFY=&SYSUID,REGION=0M
//* ------------------------------------------------------------------
//* Aggregator gateway (CTM/MSM/GoCo/Confused)
//* SCHEDULED VIA CONTROL-M - DO NOT SUBMIT MANUALLY EXCEPT UNDER
//* MIM-876831 BREAK-GLASS. LAST MANUAL SUBMIT 18-Mar-2024 CAUSED
//* DUPLICATE BACS FILE. SEE PRB-16017.
//* ------------------------------------------------------------------
//STEP010  EXEC PGM=AGIBAC01,PARM='WEEKLY'
//STEPLIB  DD DSN=AGI.PROD.LOADLIB,DISP=SHR
//POLIN    DD DSN=AGI.PROD.BILLING.MID.IN(+0),DISP=SHR
//POLOUT   DD DSN=AGI.PROD.BILLING.MID.OUT(+1),DISP=(NEW,CATLG,DELETE),
//            SPACE=(CYL,(500,100),RLSE),
//            DCB=(RECFM=FB,LRECL=300,BLKSIZE=0)
//SYSOUT   DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//STEP020  EXEC PGM=IEBGENER,COND=(0,NE,STEP010)
//SYSUT1   DD DSN=AGI.PROD.BILLING.MID.OUT(+1),DISP=SHR
//SYSUT2   DD DSN=AGI.XFER.GWSUITE.AGIB870D,DISP=(NEW,CATLG),
//            SPACE=(CYL,(500,100),RLSE)
//SYSPRINT DD SYSOUT=*
//SYSIN    DD DUMMY
