//AGIB600M JOB (AGI,PROD),'CIFAS FRAUD DATABA',CLASS=A,MSGCLASS=X,
//         NOTIFY=&SYSUID,REGION=0M
//* ------------------------------------------------------------------
//* CIFAS fraud database
//* SCHEDULED VIA CONTROL-M - DO NOT SUBMIT MANUALLY EXCEPT UNDER
//* MIM-883473 BREAK-GLASS. LAST MANUAL SUBMIT 26-Apr-2025 CAUSED
//* DUPLICATE BACS FILE. SEE PRB-10886.
//* ------------------------------------------------------------------
//STEP010  EXEC PGM=AGICLM04,PARM='DAILY'
//STEPLIB  DD DSN=AGI.PROD.LOADLIB,DISP=SHR
//POLIN    DD DSN=AGI.PROD.CLAIMS.BACS.IN(+0),DISP=SHR
//POLOUT   DD DSN=AGI.PROD.CLAIMS.BACS.OUT(+1),DISP=(NEW,CATLG,DELETE),
//            SPACE=(CYL,(500,100),RLSE),
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=0)
//SYSOUT   DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//STEP020  EXEC PGM=IEBGENER,COND=(0,NE,STEP010)
//SYSUT1   DD DSN=AGI.PROD.CLAIMS.BACS.OUT(+1),DISP=SHR
//SYSUT2   DD DSN=AGI.XFER.GWSUITE.AGIB600M,DISP=(NEW,CATLG),
//            SPACE=(CYL,(500,100),RLSE)
//SYSPRINT DD SYSOUT=*
//SYSIN    DD DUMMY
