//AGIB115D JOB (AGI,PROD),'MOTOR INSURANCE DA',CLASS=A,MSGCLASS=X,
//         NOTIFY=&SYSUID,REGION=0M
//* ------------------------------------------------------------------
//* Motor Insurance Database (MIB) vehicle feed
//* SCHEDULED VIA CONTROL-M - DO NOT SUBMIT MANUALLY EXCEPT UNDER
//* MIM-366414 BREAK-GLASS. LAST MANUAL SUBMIT 27-Oct-2022 CAUSED
//* DUPLICATE BACS FILE. SEE PRB-36965.
//* ------------------------------------------------------------------
//STEP010  EXEC PGM=AGIPOL01,PARM='DAILY'
//STEPLIB  DD DSN=AGI.PROD.LOADLIB,DISP=SHR
//POLIN    DD DSN=AGI.PROD.PARTY.BACS.IN(+0),DISP=SHR
//POLOUT   DD DSN=AGI.PROD.PARTY.BACS.OUT(+1),DISP=(NEW,CATLG,DELETE),
//            SPACE=(CYL,(500,100),RLSE),
//            DCB=(RECFM=FB,LRECL=250,BLKSIZE=0)
//SYSOUT   DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//STEP020  EXEC PGM=IEBGENER,COND=(0,NE,STEP010)
//SYSUT1   DD DSN=AGI.PROD.PARTY.BACS.OUT(+1),DISP=SHR
//SYSUT2   DD DSN=AGI.XFER.GWSUITE.AGIB115D,DISP=(NEW,CATLG),
//            SPACE=(CYL,(500,100),RLSE)
//SYSPRINT DD SYSOUT=*
//SYSIN    DD DUMMY
