//AGIC892M JOB (AGI,PROD),'HMT/OFSI SANCTIONS',CLASS=A,MSGCLASS=X,
//         NOTIFY=&SYSUID,REGION=0M
//* ------------------------------------------------------------------
//* HMT/OFSI sanctions & PEP screening via WorldCheck
//* SCHEDULED VIA CONTROL-M - DO NOT SUBMIT MANUALLY EXCEPT UNDER
//* MIM-493493 BREAK-GLASS. LAST MANUAL SUBMIT 28-Apr-2019 CAUSED
//* DUPLICATE BACS FILE. SEE PRB-70309.
//* ------------------------------------------------------------------
//STEP010  EXEC PGM=AGIBAC01,PARM='WEEKLY'
//STEPLIB  DD DSN=AGI.PROD.LOADLIB,DISP=SHR
//POLIN    DD DSN=AGI.PROD.POLICY.MID.IN(+0),DISP=SHR
//POLOUT   DD DSN=AGI.PROD.POLICY.MID.OUT(+1),DISP=(NEW,CATLG,DELETE),
//            SPACE=(CYL,(500,100),RLSE),
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=0)
//SYSOUT   DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//STEP020  EXEC PGM=IEBGENER,COND=(0,NE,STEP010)
//SYSUT1   DD DSN=AGI.PROD.POLICY.MID.OUT(+1),DISP=SHR
//SYSUT2   DD DSN=AGI.XFER.GWSUITE.AGIC892M,DISP=(NEW,CATLG),
//            SPACE=(CYL,(500,100),RLSE)
//SYSPRINT DD SYSOUT=*
//SYSIN    DD DUMMY
