//AGIC998M JOB (AGI,PROD),'EXPERIAN CREDIT & ',CLASS=A,MSGCLASS=X,
//         NOTIFY=&SYSUID,REGION=0M
//* ------------------------------------------------------------------
//* Experian credit & quote-manipulation checks
//* SCHEDULED VIA CONTROL-M - DO NOT SUBMIT MANUALLY EXCEPT UNDER
//* MIM-773453 BREAK-GLASS. LAST MANUAL SUBMIT 12-Jul-2025 CAUSED
//* DUPLICATE BACS FILE. SEE PRB-41137.
//* ------------------------------------------------------------------
//STEP010  EXEC PGM=AGIPRT09,PARM='RESTART'
//STEPLIB  DD DSN=AGI.PROD.LOADLIB,DISP=SHR
//POLIN    DD DSN=AGI.PROD.CLAIMS.DWH.IN(+0),DISP=SHR
//POLOUT   DD DSN=AGI.PROD.CLAIMS.DWH.OUT(+1),DISP=(NEW,CATLG,DELETE),
//            SPACE=(CYL,(500,100),RLSE),
//            DCB=(RECFM=FB,LRECL=250,BLKSIZE=0)
//SYSOUT   DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//STEP020  EXEC PGM=IEBGENER,COND=(0,NE,STEP010)
//SYSUT1   DD DSN=AGI.PROD.CLAIMS.DWH.OUT(+1),DISP=SHR
//SYSUT2   DD DSN=AGI.XFER.GWSUITE.AGIC998M,DISP=(NEW,CATLG),
//            SPACE=(CYL,(500,100),RLSE)
//SYSPRINT DD SYSOUT=*
//SYSIN    DD DUMMY
