//AGIC920M JOB (AGI,PROD),'CLAIMS & UNDERWRIT',CLASS=A,MSGCLASS=X,
//         NOTIFY=&SYSUID,REGION=0M
//* ------------------------------------------------------------------
//* Claims & Underwriting Exchange enquiry/load
//* SCHEDULED VIA CONTROL-M - DO NOT SUBMIT MANUALLY EXCEPT UNDER
//* MIM-505371 BREAK-GLASS. LAST MANUAL SUBMIT 28-Jul-2021 CAUSED
//* DUPLICATE BACS FILE. SEE PRB-46810.
//* ------------------------------------------------------------------
//STEP010  EXEC PGM=AGIPOL01,PARM='RESTART'
//STEPLIB  DD DSN=AGI.PROD.LOADLIB,DISP=SHR
//POLIN    DD DSN=AGI.PROD.CLAIMS.BACS.IN(+0),DISP=SHR
//POLOUT   DD DSN=AGI.PROD.CLAIMS.BACS.OUT(+1),DISP=(NEW,CATLG,DELETE),
//            SPACE=(CYL,(500,100),RLSE),
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=0)
//SYSOUT   DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//STEP020  EXEC PGM=IEBGENER,COND=(0,NE,STEP010)
//SYSUT1   DD DSN=AGI.PROD.CLAIMS.BACS.OUT(+1),DISP=SHR
//SYSUT2   DD DSN=AGI.XFER.GWSUITE.AGIC920M,DISP=(NEW,CATLG),
//            SPACE=(CYL,(500,100),RLSE)
//SYSPRINT DD SYSOUT=*
//SYSIN    DD DUMMY
