//AGIC357M JOB (AGI,PROD),'GROUP DATA WAREHOU',CLASS=A,MSGCLASS=X,
//         NOTIFY=&SYSUID,REGION=0M
//* ------------------------------------------------------------------
//* Group Data Warehouse (Teradata) extract
//* SCHEDULED VIA CONTROL-M - DO NOT SUBMIT MANUALLY EXCEPT UNDER
//* MIM-197811 BREAK-GLASS. LAST MANUAL SUBMIT 27-Jun-2023 CAUSED
//* DUPLICATE BACS FILE. SEE PRB-22184.
//* ------------------------------------------------------------------
//STEP010  EXEC PGM=AGIDWH07,PARM='WEEKLY'
//STEPLIB  DD DSN=AGI.PROD.LOADLIB,DISP=SHR
//POLIN    DD DSN=AGI.PROD.POLICY.MID.IN(+0),DISP=SHR
//POLOUT   DD DSN=AGI.PROD.POLICY.MID.OUT(+1),DISP=(NEW,CATLG,DELETE),
//            SPACE=(CYL,(500,100),RLSE),
//            DCB=(RECFM=FB,LRECL=300,BLKSIZE=0)
//SYSOUT   DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//STEP020  EXEC PGM=IEBGENER,COND=(0,NE,STEP010)
//SYSUT1   DD DSN=AGI.PROD.POLICY.MID.OUT(+1),DISP=SHR
//SYSUT2   DD DSN=AGI.XFER.GWSUITE.AGIC357M,DISP=(NEW,CATLG),
//            SPACE=(CYL,(500,100),RLSE)
//SYSPRINT DD SYSOUT=*
//SYSIN    DD DUMMY
