//AGIC488D JOB (AGI,PROD),'POLARIS MAINFRAME ',CLASS=A,MSGCLASS=X,
//         NOTIFY=&SYSUID,REGION=0M
//* ------------------------------------------------------------------
//* POLARIS mainframe policy admin (heritage book) nightly sync
//* SCHEDULED VIA CONTROL-M - DO NOT SUBMIT MANUALLY EXCEPT UNDER
//* MIM-618302 BREAK-GLASS. LAST MANUAL SUBMIT 24-Aug-2022 CAUSED
//* DUPLICATE BACS FILE. SEE PRB-30759.
//* ------------------------------------------------------------------
//STEP010  EXEC PGM=AGIBAC01,PARM='WEEKLY'
//STEPLIB  DD DSN=AGI.PROD.LOADLIB,DISP=SHR
//POLIN    DD DSN=AGI.PROD.CLAIMS.PRINT.IN(+0),DISP=SHR
//POLOUT   DD DSN=AGI.PROD.CLAIMS.PRINT.OUT(+1),DISP=(NEW,CATLG,DELETE),
//            SPACE=(CYL,(500,100),RLSE),
//            DCB=(RECFM=FB,LRECL=512,BLKSIZE=0)
//SYSOUT   DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//STEP020  EXEC PGM=IEBGENER,COND=(0,NE,STEP010)
//SYSUT1   DD DSN=AGI.PROD.CLAIMS.PRINT.OUT(+1),DISP=SHR
//SYSUT2   DD DSN=AGI.XFER.GWSUITE.AGIC488D,DISP=(NEW,CATLG),
//            SPACE=(CYL,(500,100),RLSE)
//SYSPRINT DD SYSOUT=*
//SYSIN    DD DUMMY
