//AGIM777M JOB (AGI,PROD),'MOTOR INSURANCE DA',CLASS=A,MSGCLASS=X,
//         NOTIFY=&SYSUID,REGION=0M
//* ------------------------------------------------------------------
//* Motor Insurance Database (MIB) vehicle feed
//* SCHEDULED VIA CONTROL-M - DO NOT SUBMIT MANUALLY EXCEPT UNDER
//* MIM-515466 BREAK-GLASS. LAST MANUAL SUBMIT 16-Jun-2024 CAUSED
//* DUPLICATE BACS FILE. SEE PRB-41268.
//* ------------------------------------------------------------------
//STEP010  EXEC PGM=AGICLM04,PARM='RESTART'
//STEPLIB  DD DSN=AGI.PROD.LOADLIB,DISP=SHR
//POLIN    DD DSN=AGI.PROD.PARTY.PRINT.IN(+0),DISP=SHR
//POLOUT   DD DSN=AGI.PROD.PARTY.PRINT.OUT(+1),DISP=(NEW,CATLG,DELETE),
//            SPACE=(CYL,(500,100),RLSE),
//            DCB=(RECFM=FB,LRECL=400,BLKSIZE=0)
//SYSOUT   DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//STEP020  EXEC PGM=IEBGENER,COND=(0,NE,STEP010)
//SYSUT1   DD DSN=AGI.PROD.PARTY.PRINT.OUT(+1),DISP=SHR
//SYSUT2   DD DSN=AGI.XFER.GWSUITE.AGIM777M,DISP=(NEW,CATLG),
//            SPACE=(CYL,(500,100),RLSE)
//SYSPRINT DD SYSOUT=*
//SYSIN    DD DUMMY
