//AGIM118D JOB (AGI,PROD),'CRIF CLAIMS HISTOR',CLASS=A,MSGCLASS=X,
//         NOTIFY=&SYSUID,REGION=0M
//* ------------------------------------------------------------------
//* CRIF claims history
//* SCHEDULED VIA CONTROL-M - DO NOT SUBMIT MANUALLY EXCEPT UNDER
//* MIM-161400 BREAK-GLASS. LAST MANUAL SUBMIT 12-Jan-2019 CAUSED
//* DUPLICATE BACS FILE. SEE PRB-44562.
//* ------------------------------------------------------------------
//STEP010  EXEC PGM=AGIPRT09,PARM='WEEKLY'
//STEPLIB  DD DSN=AGI.PROD.LOADLIB,DISP=SHR
//POLIN    DD DSN=AGI.PROD.CLAIMS.CUE.IN(+0),DISP=SHR
//POLOUT   DD DSN=AGI.PROD.CLAIMS.CUE.OUT(+1),DISP=(NEW,CATLG,DELETE),
//            SPACE=(CYL,(500,100),RLSE),
//            DCB=(RECFM=FB,LRECL=512,BLKSIZE=0)
//SYSOUT   DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//STEP020  EXEC PGM=IEBGENER,COND=(0,NE,STEP010)
//SYSUT1   DD DSN=AGI.PROD.CLAIMS.CUE.OUT(+1),DISP=SHR
//SYSUT2   DD DSN=AGI.XFER.GWSUITE.AGIM118D,DISP=(NEW,CATLG),
//            SPACE=(CYL,(500,100),RLSE)
//SYSPRINT DD SYSOUT=*
//SYSIN    DD DUMMY
