//AGIM269D JOB (AGI,PROD),'REINSURANCE BORDER',CLASS=A,MSGCLASS=X,
//         NOTIFY=&SYSUID,REGION=0M
//* ------------------------------------------------------------------
//* Reinsurance bordereaux (XL Cat programme)
//* SCHEDULED VIA CONTROL-M - DO NOT SUBMIT MANUALLY EXCEPT UNDER
//* MIM-617694 BREAK-GLASS. LAST MANUAL SUBMIT 08-Apr-2021 CAUSED
//* DUPLICATE BACS FILE. SEE PRB-23645.
//* ------------------------------------------------------------------
//STEP010  EXEC PGM=AGIMID02,PARM='WEEKLY'
//STEPLIB  DD DSN=AGI.PROD.LOADLIB,DISP=SHR
//POLIN    DD DSN=AGI.PROD.POLICY.MID.IN(+0),DISP=SHR
//POLOUT   DD DSN=AGI.PROD.POLICY.MID.OUT(+1),DISP=(NEW,CATLG,DELETE),
//            SPACE=(CYL,(500,100),RLSE),
//            DCB=(RECFM=FB,LRECL=400,BLKSIZE=0)
//SYSOUT   DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//STEP020  EXEC PGM=IEBGENER,COND=(0,NE,STEP010)
//SYSUT1   DD DSN=AGI.PROD.POLICY.MID.OUT(+1),DISP=SHR
//SYSUT2   DD DSN=AGI.XFER.GWSUITE.AGIM269D,DISP=(NEW,CATLG),
//            SPACE=(CYL,(500,100),RLSE)
//SYSPRINT DD SYSOUT=*
//SYSIN    DD DUMMY
