//AGIP137D JOB (AGI,PROD),'GROUP PAYMENT HUB ',CLASS=A,MSGCLASS=X,
//         NOTIFY=&SYSUID,REGION=0M
//* ------------------------------------------------------------------
//* Group Payment Hub (BACS/Direct Debit/Faster Payments)
//* SCHEDULED VIA CONTROL-M - DO NOT SUBMIT MANUALLY EXCEPT UNDER
//* MIM-750429 BREAK-GLASS. LAST MANUAL SUBMIT 18-Apr-2021 CAUSED
//* DUPLICATE BACS FILE. SEE PRB-27271.
//* ------------------------------------------------------------------
//STEP010  EXEC PGM=AGIPRT09,PARM='RESTART'
//STEPLIB  DD DSN=AGI.PROD.LOADLIB,DISP=SHR
//POLIN    DD DSN=AGI.PROD.PARTY.BACS.IN(+0),DISP=SHR
//POLOUT   DD DSN=AGI.PROD.PARTY.BACS.OUT(+1),DISP=(NEW,CATLG,DELETE),
//            SPACE=(CYL,(500,100),RLSE),
//            DCB=(RECFM=FB,LRECL=300,BLKSIZE=0)
//SYSOUT   DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//STEP020  EXEC PGM=IEBGENER,COND=(0,NE,STEP010)
//SYSUT1   DD DSN=AGI.PROD.PARTY.BACS.OUT(+1),DISP=SHR
//SYSUT2   DD DSN=AGI.XFER.GWSUITE.AGIP137D,DISP=(NEW,CATLG),
//            SPACE=(CYL,(500,100),RLSE)
//SYSPRINT DD SYSOUT=*
//SYSIN    DD DUMMY
