//AGIP174M JOB (AGI,PROD),'CLAIMS & UNDERWRIT',CLASS=A,MSGCLASS=X,
//         NOTIFY=&SYSUID,REGION=0M
//* ------------------------------------------------------------------
//* Claims & Underwriting Exchange enquiry/load
//* SCHEDULED VIA CONTROL-M - DO NOT SUBMIT MANUALLY EXCEPT UNDER
//* MIM-195529 BREAK-GLASS. LAST MANUAL SUBMIT 14-Nov-2019 CAUSED
//* DUPLICATE BACS FILE. SEE PRB-98453.
//* ------------------------------------------------------------------
//STEP010  EXEC PGM=AGIBAC01,PARM='WEEKLY'
//STEPLIB  DD DSN=AGI.PROD.LOADLIB,DISP=SHR
//POLIN    DD DSN=AGI.PROD.BILLING.CUE.IN(+0),DISP=SHR
//POLOUT   DD DSN=AGI.PROD.BILLING.CUE.OUT(+1),DISP=(NEW,CATLG,DELETE),
//            SPACE=(CYL,(500,100),RLSE),
//            DCB=(RECFM=FB,LRECL=512,BLKSIZE=0)
//SYSOUT   DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//STEP020  EXEC PGM=IEBGENER,COND=(0,NE,STEP010)
//SYSUT1   DD DSN=AGI.PROD.BILLING.CUE.OUT(+1),DISP=SHR
//SYSUT2   DD DSN=AGI.XFER.GWSUITE.AGIP174M,DISP=(NEW,CATLG),
//            SPACE=(CYL,(500,100),RLSE)
//SYSPRINT DD SYSOUT=*
//SYSIN    DD DUMMY
