//AGIP609W JOB (AGI,PROD),'HMT/OFSI SANCTIONS',CLASS=A,MSGCLASS=X,
//         NOTIFY=&SYSUID,REGION=0M
//* ------------------------------------------------------------------
//* HMT/OFSI sanctions & PEP screening via WorldCheck
//* SCHEDULED VIA CONTROL-M - DO NOT SUBMIT MANUALLY EXCEPT UNDER
//* MIM-743508 BREAK-GLASS. LAST MANUAL SUBMIT 08-Oct-2023 CAUSED
//* DUPLICATE BACS FILE. SEE PRB-53388.
//* ------------------------------------------------------------------
//STEP010  EXEC PGM=AGIBAC01,PARM='DAILY'
//STEPLIB  DD DSN=AGI.PROD.LOADLIB,DISP=SHR
//POLIN    DD DSN=AGI.PROD.PARTY.BACS.IN(+0),DISP=SHR
//POLOUT   DD DSN=AGI.PROD.PARTY.BACS.OUT(+1),DISP=(NEW,CATLG,DELETE),
//            SPACE=(CYL,(500,100),RLSE),
//            DCB=(RECFM=FB,LRECL=400,BLKSIZE=0)
//SYSOUT   DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//STEP020  EXEC PGM=IEBGENER,COND=(0,NE,STEP010)
//SYSUT1   DD DSN=AGI.PROD.PARTY.BACS.OUT(+1),DISP=SHR
//SYSUT2   DD DSN=AGI.XFER.GWSUITE.AGIP609W,DISP=(NEW,CATLG),
//            SPACE=(CYL,(500,100),RLSE)
//SYSPRINT DD SYSOUT=*
//SYSIN    DD DUMMY
