//AGIP357M JOB (AGI,PROD),'DVLA MYLICENCE ADD',CLASS=A,MSGCLASS=X,
//         NOTIFY=&SYSUID,REGION=0M
//* ------------------------------------------------------------------
//* DVLA MyLicence ADD/DDS lookup
//* SCHEDULED VIA CONTROL-M - DO NOT SUBMIT MANUALLY EXCEPT UNDER
//* MIM-459788 BREAK-GLASS. LAST MANUAL SUBMIT 01-Mar-2019 CAUSED
//* DUPLICATE BACS FILE. SEE PRB-75305.
//* ------------------------------------------------------------------
//STEP010  EXEC PGM=AGIMID02,PARM='WEEKLY'
//STEPLIB  DD DSN=AGI.PROD.LOADLIB,DISP=SHR
//POLIN    DD DSN=AGI.PROD.PARTY.DWH.IN(+0),DISP=SHR
//POLOUT   DD DSN=AGI.PROD.PARTY.DWH.OUT(+1),DISP=(NEW,CATLG,DELETE),
//            SPACE=(CYL,(500,100),RLSE),
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=0)
//SYSOUT   DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//STEP020  EXEC PGM=IEBGENER,COND=(0,NE,STEP010)
//SYSUT1   DD DSN=AGI.PROD.PARTY.DWH.OUT(+1),DISP=SHR
//SYSUT2   DD DSN=AGI.XFER.GWSUITE.AGIP357M,DISP=(NEW,CATLG),
//            SPACE=(CYL,(500,100),RLSE)
//SYSPRINT DD SYSOUT=*
//SYSIN    DD DUMMY
