//AGIP801M JOB (AGI,PROD),'EMPLOYERS LIABILIT',CLASS=A,MSGCLASS=X,
//         NOTIFY=&SYSUID,REGION=0M
//* ------------------------------------------------------------------
//* Employers Liability Tracing Office ELD feed
//* SCHEDULED VIA CONTROL-M - DO NOT SUBMIT MANUALLY EXCEPT UNDER
//* MIM-737997 BREAK-GLASS. LAST MANUAL SUBMIT 06-Oct-2022 CAUSED
//* DUPLICATE BACS FILE. SEE PRB-79796.
//* ------------------------------------------------------------------
//STEP010  EXEC PGM=AGIBAC01,PARM='DAILY'
//STEPLIB  DD DSN=AGI.PROD.LOADLIB,DISP=SHR
//POLIN    DD DSN=AGI.PROD.PARTY.BACS.IN(+0),DISP=SHR
//POLOUT   DD DSN=AGI.PROD.PARTY.BACS.OUT(+1),DISP=(NEW,CATLG,DELETE),
//            SPACE=(CYL,(500,100),RLSE),
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=0)
//SYSOUT   DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//STEP020  EXEC PGM=IEBGENER,COND=(0,NE,STEP010)
//SYSUT1   DD DSN=AGI.PROD.PARTY.BACS.OUT(+1),DISP=SHR
//SYSUT2   DD DSN=AGI.XFER.GWSUITE.AGIP801M,DISP=(NEW,CATLG),
//            SPACE=(CYL,(500,100),RLSE)
//SYSPRINT DD SYSOUT=*
//SYSIN    DD DUMMY
