//AGIP299W JOB (AGI,PROD),'VERISK PROPERTY DA',CLASS=A,MSGCLASS=X,
//         NOTIFY=&SYSUID,REGION=0M
//* ------------------------------------------------------------------
//* Verisk property data enrichment
//* SCHEDULED VIA CONTROL-M - DO NOT SUBMIT MANUALLY EXCEPT UNDER
//* MIM-148082 BREAK-GLASS. LAST MANUAL SUBMIT 23-May-2023 CAUSED
//* DUPLICATE BACS FILE. SEE PRB-46597.
//* ------------------------------------------------------------------
//STEP010  EXEC PGM=AGICLM04,PARM='RESTART'
//STEPLIB  DD DSN=AGI.PROD.LOADLIB,DISP=SHR
//POLIN    DD DSN=AGI.PROD.POLICY.DWH.IN(+0),DISP=SHR
//POLOUT   DD DSN=AGI.PROD.POLICY.DWH.OUT(+1),DISP=(NEW,CATLG,DELETE),
//            SPACE=(CYL,(500,100),RLSE),
//            DCB=(RECFM=FB,LRECL=400,BLKSIZE=0)
//SYSOUT   DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//STEP020  EXEC PGM=IEBGENER,COND=(0,NE,STEP010)
//SYSUT1   DD DSN=AGI.PROD.POLICY.DWH.OUT(+1),DISP=SHR
//SYSUT2   DD DSN=AGI.XFER.GWSUITE.AGIP299W,DISP=(NEW,CATLG),
//            SPACE=(CYL,(500,100),RLSE)
//SYSPRINT DD SYSOUT=*
//SYSIN    DD DUMMY
